espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/prepayment-server/prepayment-debt-log.c
/***************************************************************************//**
 * @file
 * @brief Implemented routines for prepayment server.
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc. Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement. This
 * software is distributed to you in Source Code format and is governed by the
 * sections of the MSLA applicable to Source Code.
 *
 ******************************************************************************/

#include "app/framework/include/af.h"
#include "app/framework/util/common.h"
#include "prepayment-debt-log.h"
#include "prepayment-debt-schedule.h"

#ifdef UC_BUILD
#include "prepayment-server-config.h"
#include "sl_component_catalog.h"
#include "zap-cluster-command-parser.h"
#else // !UC_BUILD
#ifdef EMBER_AF_PLUGIN_GBCS_COMPATIBILITY
#define SL_CATALOG_ZIGBEE_GBCS_COMPATIBILITY_PRESENT
#endif
#endif // UC_BUILD

// Each entry stores information from a debt collection event where an amount was applied towards debt reduction.
typedef struct {
  uint32_t collectionTime;
  uint32_t amountCollected;
  uint32_t outstandingDebt;
  uint8_t  debtType;    // Indicates if the entry is for Debt #1, #2, or #3
} emDebtLogEntry;

#define DEBT_LOG_TABLE_SIZE  EMBER_AF_PLUGIN_PREPAYMENT_SERVER_DEBT_LOG_CAPACITY
#define DEBT_TYPE_INVALID    0xFE

#define DEBT_RECOVERY_GROUP_DELTA  0x10
#define DEBT_TYPE_INCREMENT_FLAG  0x01
#define DEBT_ATTRIB_NO_CHANGE32  0xFFFFFFFF
#define DEBT_ATTRIB_NO_CHANGE16  0xFFFF
#define DEBT_ATTRIB_NO_CHANGE8  0xFF
enum {
  CHANGE_DEBT_AMOUNT_TYPE_1_ABS = 0x00,
  CHANGE_DEBT_AMOUNT_TYPE_1_INC = 0x01,
  CHANGE_DEBT_AMOUNT_TYPE_2_ABS = 0x02,
  CHANGE_DEBT_AMOUNT_TYPE_2_INC = 0x03,
  CHANGE_DEBT_AMOUNT_TYPE_3_ABS = 0x04,
  CHANGE_DEBT_AMOUNT_TYPE_3_INC = 0x05,
};

static emDebtLogEntry DebtLogTable[DEBT_LOG_TABLE_SIZE];

static uint8_t getNextAvailableDebtLogIndex(void);
static uint8_t getMostRecentDebtLogEntry(uint8_t debtType);
static uint8_t getNthMostRecentDebtLogEntry(uint8_t debtType, uint8_t nth, uint8_t mostRecentIndex);
void emberAfPluginLogDebtCollectionEvent(uint32_t collectionTimeUtc, uint32_t amountCollected, uint32_t outstandingDebt, uint8_t debtType);

static void emberAfPluginPrepaymentServerPublishDebtLog(EmberNodeId nodeId, uint8_t srcEndpoint, uint8_t dstEndpoint,
                                                        uint8_t commandIndex, uint8_t totalNumberOfCommands,
                                                        DebtPayload *debtPayload);

// Initialize the contents of the Debt Log
void emberAfPluginPrepaymentServerInitDebtLog()
{
  uint8_t i;
  for ( i = 0; i < DEBT_LOG_TABLE_SIZE; i++ ) {
    DebtLogTable[i].collectionTime = 0;
    DebtLogTable[i].amountCollected = 0;
    DebtLogTable[i].outstandingDebt = 0;
    DebtLogTable[i].debtType = DEBT_TYPE_INVALID;
  }
}

// Returns the next index available for use.  Once the log has filled up,
// this will return the oldest log entry.
static uint8_t getNextAvailableDebtLogIndex()
{
  uint8_t i;
  uint32_t minCollectionTime = 0xFFFFFFFF;
  uint8_t  minCollectionTimeIndex = 0;

  for ( i = 0; i < DEBT_LOG_TABLE_SIZE; i++ ) {
    if ( DebtLogTable[i].collectionTime == 0 ) {
      // Found unused log entry.
      minCollectionTimeIndex = i;
      break;
    } else if ( DebtLogTable[i].collectionTime < minCollectionTime ) {
      minCollectionTime = DebtLogTable[i].collectionTime;
      minCollectionTimeIndex = i;
    }
  }
  return minCollectionTimeIndex;
}

// Returns the most recent entry index - meaning, the entry whose
// collection time occurred closest to right now.
static uint8_t getMostRecentDebtLogEntry(uint8_t debtType)
{
  // To do this, find the most recent log entry index.
  // Then decrement (and wrap) the index 'index' times to get to the Nth most recent entry.
  uint8_t i;
  uint32_t minDeltaTime = 0xFFFFFFFF;
  uint8_t  minDeltaTimeIndex = 0xFF;
  uint32_t currentTime;
  uint32_t deltaTime;

  currentTime = emberAfGetCurrentTime();
  for ( i = 0; i < DEBT_LOG_TABLE_SIZE; i++ ) {
    if ( (DebtLogTable[i].collectionTime != 0)
         && ((debtType == DEBT_TYPE_ALL) || (debtType == DebtLogTable[i].debtType)) ) {
      deltaTime = currentTime - DebtLogTable[i].collectionTime;
      if ( deltaTime < minDeltaTime ) {
        minDeltaTime = deltaTime;
        minDeltaTimeIndex = i;
      }
    }
  }
  return minDeltaTimeIndex;
}

// Returns the "nth" most recent occuring entry - meaning, the nth entry
// whose collection time most recently occurred relative to right now.
static uint8_t getNthMostRecentDebtLogEntry(uint8_t debtType, uint8_t nth, uint8_t mostRecentIndex)
{
  // "nth" indicates which of the most recent entries should be retrieved.
  // An 'nth' value of '0' is the newest.
  // The "mostRecentiIndex" parameter should be obtained by calling getMostRecentDebtLogEntry().
  uint8_t i;
  uint8_t nthMostRecentIndex = 0xFF;

  if ( mostRecentIndex < DEBT_LOG_TABLE_SIZE ) {
    i = mostRecentIndex;

    // Go through the log until "nth" found, or until we reach the mostRecentIndex
    while ( 1 ) {
      if ( (DebtLogTable[i].debtType == debtType) || (debtType == DEBT_TYPE_ALL) ) {
        // valid matching entry
        if ( nth == 0 ) {
          nthMostRecentIndex = i;
          break;
        } else {
          nth--;
        }
      }
      if ( i == 0 ) {
        i = DEBT_LOG_TABLE_SIZE - 1;
      } else {
        i--;
      }
      if ( i == mostRecentIndex ) {
        // Wrap occurred - abort.
        break;
      }
    }
  }
  return nthMostRecentIndex;
}

#define DEBT_ATTRIBUTE_GROUP_DELTA  0x10
#define MAX_DEBT_PAYLOAD_LEN  13
#define MAX_DEBTS  3
#define CMD_INDEX_LAST_CMD  0xFE

enum {
  DEBT_RECOVERY_METHOD_TIME_BASED = 0,
  DEBT_RECOVERY_METHOD_PERCENT_BASED = 1,
  DEBT_RECOVERY_METHOD_CATCH_UP_BASED = 2,
};

void emberAfPluginUpdateDebtOnCollectionEvent(uint8_t endpoint, uint8_t debtType)
{
  // uint8_t i;
  uint16_t attributeId;
  uint8_t debtRecoveryMethod;
  uint32_t debtRecoveryAmount;
  uint32_t debtAmount;
  EmberAfStatus status;
  uint32_t now;
  uint32_t startTime;

  if ( debtType <= DEBT_TYPE_3 ) {
    // Reduce the debt amount if the method is TIME- or CATCH-UP-based.  Do nothing for PERCENTAGE-Based.
    attributeId = ZCL_DEBT_RECOVERY_METHOD_1_ATTRIBUTE_ID + (debtType * DEBT_RECOVERY_GROUP_DELTA);
    status = emberAfReadAttribute(endpoint, ZCL_PREPAYMENT_CLUSTER_ID, attributeId, CLUSTER_MASK_SERVER,
                                  &debtRecoveryMethod, 1, NULL);

    if ( (status == EMBER_ZCL_STATUS_SUCCESS)
         && ((debtRecoveryMethod == DEBT_RECOVERY_METHOD_TIME_BASED) || (debtRecoveryMethod == DEBT_RECOVERY_METHOD_CATCH_UP_BASED)) ) {
      // Time based recovery.
      now = emberAfGetCurrentTime();
      attributeId = ZCL_DEBT_RECOVERY_START_TIME_1_ATTRIBUTE_ID + (debtType * DEBT_RECOVERY_GROUP_DELTA);
      status = emberAfReadAttribute(endpoint, ZCL_PREPAYMENT_CLUSTER_ID, attributeId, CLUSTER_MASK_SERVER,
                                    (uint8_t *)&startTime, 4, NULL);

