espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/prepayment-server/prepayment-debt-log.c
      if ( (status == EMBER_ZCL_STATUS_UNSUPPORTED_ATTRIBUTE)
           || ( (status == EMBER_ZCL_STATUS_SUCCESS) && (now >= startTime) ) ) {
        // Valid time to do collection.
        // Get debt recovery amount and subtract it from the debt amount.
        attributeId = ZCL_DEBT_RECOVERY_AMOUNT_1_ATTRIBUTE_ID + (debtType * DEBT_RECOVERY_GROUP_DELTA);
        status = emberAfReadAttribute(endpoint, ZCL_PREPAYMENT_CLUSTER_ID, attributeId, CLUSTER_MASK_SERVER,
                                      (uint8_t *)&debtRecoveryAmount, 4, NULL);
        attributeId = ZCL_DEBT_AMOUNT_1_ATTRIBUTE_ID + (debtType * DEBT_RECOVERY_GROUP_DELTA);
        status |= emberAfReadAttribute(endpoint, ZCL_PREPAYMENT_CLUSTER_ID, attributeId, CLUSTER_MASK_SERVER,
                                       (uint8_t *)&debtAmount, 4, NULL);
        if ( (status == EMBER_ZCL_STATUS_SUCCESS) && (debtAmount > 0) && (debtRecoveryAmount > 0) ) {
          //
          if ( debtAmount >= debtRecoveryAmount ) {
            debtAmount -= debtRecoveryAmount;
          } else {
            debtAmount = 0;
          }
          (void) emberAfWriteAttribute(endpoint, ZCL_PREPAYMENT_CLUSTER_ID, attributeId, CLUSTER_MASK_SERVER,
                                       (uint8_t *)&debtAmount, ZCL_INT32U_ATTRIBUTE_TYPE);
          // log the debt transaction to the debt log.
          emberAfPluginLogDebtCollectionEvent(now, debtRecoveryAmount, debtAmount, debtType);
        }
      }
    }
  }
}

void emberAfPluginLogDebtCollectionEvent(uint32_t collectionTimeUtc, uint32_t amountCollected, uint32_t outstandingDebt, uint8_t debtType)
{
  uint8_t i;
  i = getNextAvailableDebtLogIndex();
  if ( i < DEBT_LOG_TABLE_SIZE ) {
    DebtLogTable[i].collectionTime = collectionTimeUtc;
    DebtLogTable[i].amountCollected = amountCollected;
    DebtLogTable[i].outstandingDebt = outstandingDebt;
    DebtLogTable[i].debtType = debtType;    // = debt #0, #1, #2
  }
}

static uint8_t NumDebtPayloads;
// Formats the debt log response data prior to calling the function to send the log data.
void emberAfPluginSendPublishDebtLog(EmberNodeId nodeId, uint8_t srcEndpoint, uint8_t dstEndpoint,
                                     uint32_t latestEndTime, uint8_t numberOfDebts, uint8_t debtType)
{
  DebtPayload debtPayloads[DEBT_LOG_TABLE_SIZE];      // Size this to max number of log entries.
  uint8_t  i, x;
  uint8_t mostRecentIndex;

  // The first returned should be the most recent with its collection time <= latest end time.
  if ( numberOfDebts == 0 ) {
    numberOfDebts = DEBT_LOG_TABLE_SIZE;
  }

  mostRecentIndex = getMostRecentDebtLogEntry(debtType);
  if ( mostRecentIndex >= DEBT_LOG_TABLE_SIZE ) {
    // No entries for this debt type
    emberAfPrepaymentClusterPrintln("No Matching Debt Log Entries");
    emberAfSendImmediateDefaultResponse(EMBER_ZCL_STATUS_NOT_FOUND);
  } else {
    // Store debt log entries for transmission
    for ( i = 0; i < numberOfDebts; i++ ) {
      x = getNthMostRecentDebtLogEntry(debtType, i, mostRecentIndex);
      if ( x < DEBT_LOG_TABLE_SIZE ) {
        debtPayloads[i].collectionTime = DebtLogTable[x].collectionTime;
        debtPayloads[i].amountCollected = DebtLogTable[x].amountCollected;
        debtPayloads[i].outstandingDebt = DebtLogTable[x].outstandingDebt;
        debtPayloads[i].debtType        = DebtLogTable[x].debtType;
      } else {
        break;
      }
    }
    // "i" now indicates how many responses were put into debtPayloads[].
    NumDebtPayloads = i;
    emberAfPrepaymentClusterPrintln("Send Publish Debt Log, %d entries", NumDebtPayloads);
    emberAfPluginPrepaymentServerPublishDebtLog(nodeId, srcEndpoint, dstEndpoint, CMD_INDEX_LAST_CMD, 1, debtPayloads);
  }
}

// Sends the Publish Debt Log command.
// NOTE:  DebtPayload is a struct type.  See se-meter-gas/gen/simulation/af-structs.h
static void emberAfPluginPrepaymentServerPublishDebtLog(EmberNodeId nodeId, uint8_t srcEndpoint, uint8_t dstEndpoint,
                                                        uint8_t commandIndex, uint8_t totalNumberOfCommands,
                                                        DebtPayload *debtPayload)
{
  EmberStatus status;
  // uint16_t debtPayloadLen=0;
  uint8_t i;

  // For GBCS use cases, we should be setting the disable default response bit.
  (void) emberAfFillExternalBuffer( (ZCL_CLUSTER_SPECIFIC_COMMAND
                                     | ZCL_FRAME_CONTROL_SERVER_TO_CLIENT
#ifdef SL_CATALOG_ZIGBEE_GBCS_COMPATIBILITY_PRESENT
                                     | ZCL_DISABLE_DEFAULT_RESPONSE_MASK
#endif
                                     ),
                                    ZCL_PREPAYMENT_CLUSTER_ID,
                                    ZCL_PUBLISH_DEBT_LOG_COMMAND_ID,
                                    "uu",
                                    commandIndex, totalNumberOfCommands);
  for ( i = 0; i < NumDebtPayloads; i++ ) {
    (void) emberAfPutInt32uInResp(debtPayload[i].collectionTime);
    (void) emberAfPutInt32uInResp(debtPayload[i].amountCollected);
    (void) emberAfPutInt8uInResp(debtPayload[i].debtType);
    (void) emberAfPutInt32uInResp(debtPayload[i].outstandingDebt);
  }

  emberAfSetCommandEndpoints(srcEndpoint, dstEndpoint);
  emberAfGetCommandApsFrame()->options |= EMBER_APS_OPTION_SOURCE_EUI64;
  status = emberAfSendCommandUnicast(EMBER_OUTGOING_DIRECT, nodeId);
  if ( status != EMBER_SUCCESS ) {
    emberAfPrepaymentClusterPrintln("Error in Publish Debt Log %x", status);
  }
}

//-----------------------
// ZCL commands callbacks

#ifdef UC_BUILD

// Handles the prepayment Change Debt command.
bool emberAfPrepaymentClusterChangeDebtCallback(EmberAfClusterCommand *cmd)
{
  sl_zcl_prepayment_cluster_change_debt_command_t cmd_data;
  uint8_t endpoint;
  uint16_t attributeId;
  uint8_t  attributeGroupOffset;
  uint32_t currentDebt;
  uint8_t  debtType;

  endpoint = emberAfCurrentEndpoint();

  if (zcl_decode_prepayment_cluster_change_debt_command(cmd, &cmd_data)
      != EMBER_ZCL_STATUS_SUCCESS) {
    return false;
  }

  // Look at the debtAmountType field to see how to process the new debt -
  // could be applied incrementally or absolutely.
  // The debtAmountType also indicates which debt type is being updated.

