espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/prepayment-server/prepayment-debt-log.c
  if ( cmd_data.debtAmountType <= CHANGE_DEBT_AMOUNT_TYPE_1_INC ) {
    attributeGroupOffset = 0;   // DEBT_#1
    debtType = 0;
  } else if ( cmd_data.debtAmountType <= CHANGE_DEBT_AMOUNT_TYPE_2_INC ) {
    attributeGroupOffset = DEBT_RECOVERY_GROUP_DELTA;   // DEBT_#2
    debtType = 1;
  } else if ( cmd_data.debtAmountType <= CHANGE_DEBT_AMOUNT_TYPE_3_INC ) {
    attributeGroupOffset = (DEBT_RECOVERY_GROUP_DELTA * 2);   // DEBT_#3
    debtType = 2;
  } else {
    emberAfSendImmediateDefaultResponse(EMBER_ZCL_STATUS_NOT_FOUND);
    return true;
  }

  // TODO:  Ensure the event Id is > any previous event ID for this debt type.

  currentDebt = 0;
  if ( (cmd_data.debtAmount != DEBT_ATTRIB_NO_CHANGE32) && (cmd_data.debtAmountType & DEBT_TYPE_INCREMENT_FLAG) ) {
    attributeId = ZCL_DEBT_AMOUNT_1_ATTRIBUTE_ID + attributeGroupOffset;
    emberAfReadAttribute(endpoint, ZCL_PREPAYMENT_CLUSTER_ID, attributeId,
                         CLUSTER_MASK_SERVER, (uint8_t *)&currentDebt, 4, NULL);

    cmd_data.debtAmount += currentDebt;    // Increment new value to the current debt.
  }

  // Update attribute values, but only if they are not set to NO_CHANGES values
  if ( cmd_data.debtLabel[0] != 0xFF ) {
    attributeId = ZCL_DEBT_LABEL_1_ATTRIBUTE_ID + attributeGroupOffset;
    (void) emberAfWriteAttribute(endpoint, ZCL_PREPAYMENT_CLUSTER_ID, attributeId, CLUSTER_MASK_SERVER,
                                 cmd_data.debtLabel, ZCL_OCTET_STRING_ATTRIBUTE_TYPE);
  }

  if ( cmd_data.debtAmount != DEBT_ATTRIB_NO_CHANGE32 ) {
    attributeId = ZCL_DEBT_AMOUNT_1_ATTRIBUTE_ID + attributeGroupOffset;
    (void) emberAfWriteAttribute(endpoint, ZCL_PREPAYMENT_CLUSTER_ID, attributeId, CLUSTER_MASK_SERVER,
                                 (uint8_t *)&cmd_data.debtAmount, ZCL_INT32U_ATTRIBUTE_TYPE);
  }

  if ( cmd_data.debtRecoveryMethod != DEBT_ATTRIB_NO_CHANGE8 ) {
    attributeId = ZCL_DEBT_RECOVERY_METHOD_1_ATTRIBUTE_ID + attributeGroupOffset;
    (void) emberAfWriteAttribute(endpoint, ZCL_PREPAYMENT_CLUSTER_ID, attributeId, CLUSTER_MASK_SERVER,
                                 &cmd_data.debtRecoveryMethod, ZCL_INT8U_ATTRIBUTE_TYPE);
  }

  if ( cmd_data.debtRecoveryStartTime != DEBT_ATTRIB_NO_CHANGE32 ) {
    attributeId = ZCL_DEBT_RECOVERY_START_TIME_1_ATTRIBUTE_ID + attributeGroupOffset;
    (void) emberAfWriteAttribute(endpoint, ZCL_PREPAYMENT_CLUSTER_ID, attributeId, CLUSTER_MASK_SERVER,
                                 (uint8_t *)&cmd_data.debtRecoveryStartTime, ZCL_UTC_TIME_ATTRIBUTE_TYPE);
  } else {
    attributeId = ZCL_DEBT_RECOVERY_START_TIME_1_ATTRIBUTE_ID + attributeGroupOffset;
    emberAfReadAttribute(endpoint, ZCL_PREPAYMENT_CLUSTER_ID, attributeId, CLUSTER_MASK_SERVER,
                         (uint8_t *)&cmd_data.debtRecoveryStartTime, 4, NULL);
  }

  if ( cmd_data.debtRecoveryCollectionTime != DEBT_ATTRIB_NO_CHANGE16 ) {
    attributeId = ZCL_DEBT_RECOVERY_COLLECTION_TIME_1_ATTRIBUTE_ID + attributeGroupOffset;
    (void) emberAfWriteAttribute(endpoint, ZCL_PREPAYMENT_CLUSTER_ID, attributeId, CLUSTER_MASK_SERVER,
                                 (uint8_t *)&cmd_data.debtRecoveryCollectionTime, ZCL_INT16U_ATTRIBUTE_TYPE);
  } else {
    attributeId = ZCL_DEBT_RECOVERY_COLLECTION_TIME_1_ATTRIBUTE_ID + attributeGroupOffset;
    emberAfReadAttribute(endpoint, ZCL_PREPAYMENT_CLUSTER_ID, attributeId, CLUSTER_MASK_SERVER,
                         (uint8_t *)&cmd_data.debtRecoveryCollectionTime, 2, NULL);
  }

  if ( cmd_data.debtRecoveryFrequency != DEBT_ATTRIB_NO_CHANGE8 ) {
    attributeId = ZCL_DEBT_RECOVERY_FREQUENCY_1_ATTRIBUTE_ID + attributeGroupOffset;
    (void) emberAfWriteAttribute(endpoint, ZCL_PREPAYMENT_CLUSTER_ID, attributeId, CLUSTER_MASK_SERVER,
                                 &cmd_data.debtRecoveryFrequency, ZCL_INT8U_ATTRIBUTE_TYPE);
  } else {
    attributeId = ZCL_DEBT_RECOVERY_FREQUENCY_1_ATTRIBUTE_ID + attributeGroupOffset;
    emberAfReadAttribute(endpoint, ZCL_PREPAYMENT_CLUSTER_ID, attributeId, CLUSTER_MASK_SERVER,
                         &cmd_data.debtRecoveryFrequency, 1, NULL);
  }

  if ( cmd_data.debtRecoveryAmount != DEBT_ATTRIB_NO_CHANGE32 ) {
    attributeId = ZCL_DEBT_RECOVERY_AMOUNT_1_ATTRIBUTE_ID + attributeGroupOffset;
    (void) emberAfWriteAttribute(endpoint, ZCL_PREPAYMENT_CLUSTER_ID, attributeId, CLUSTER_MASK_SERVER,
                                 (uint8_t *)&cmd_data.debtRecoveryAmount, ZCL_INT32U_ATTRIBUTE_TYPE);
  }

  if ( cmd_data.debtRecoveryBalancePercentage != DEBT_ATTRIB_NO_CHANGE16 ) {
    attributeId = ZCL_DEBT_RECOVERY_TOP_UP_PERCENTAGE_1_ATTRIBUTE_ID + attributeGroupOffset;
    (void) emberAfWriteAttribute(endpoint, ZCL_PREPAYMENT_CLUSTER_ID, attributeId, CLUSTER_MASK_SERVER,
                                 (uint8_t *)&cmd_data.debtRecoveryBalancePercentage, ZCL_INT16U_ATTRIBUTE_TYPE);
  }
  emberAfPrepaymentClusterPrintln("RX Change Debt");
  emberAfPluginPrepaymentServerScheduleDebtRepayment(endpoint, cmd_data.issuerEventId, debtType, cmd_data.debtRecoveryCollectionTime,
                                                     cmd_data.debtRecoveryStartTime, cmd_data.debtRecoveryFrequency);
  return true;
}

// Handles the Get Debt Repayment Log command and sends a "Publish Debt Log" response
// command that provides the requested info from the debt log.
bool emberAfPrepaymentClusterGetDebtRepaymentLogCallback(EmberAfClusterCommand *cmd)
{
  sl_zcl_prepayment_cluster_get_debt_repayment_log_command_t cmd_data;
  EmberNodeId nodeId;
  uint8_t srcEndpoint, dstEndpoint;

  if (zcl_decode_prepayment_cluster_get_debt_repayment_log_command(cmd, &cmd_data)
      != EMBER_ZCL_STATUS_SUCCESS) {
    return false;
  }

  emberAfPrepaymentClusterPrintln("RX: GetDebtLog, endTime=0x%4x, numDebts=%d, debtType=%d",
                                  cmd_data.latestEndTime, cmd_data.numberOfDebts, cmd_data.debtType);
  nodeId = emberAfCurrentCommand()->source;
  srcEndpoint = emberAfGetCommandApsFrame()->destinationEndpoint;
  dstEndpoint = emberAfGetCommandApsFrame()->sourceEndpoint;
  emberAfSetCommandEndpoints(srcEndpoint, dstEndpoint);

  emberAfPluginSendPublishDebtLog(nodeId, srcEndpoint, dstEndpoint, cmd_data.latestEndTime, cmd_data.numberOfDebts, cmd_data.debtType);

