espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/prepayment-server/prepayment-debt-log.c
  emberAfPrepaymentClusterPrintln("RX: GetDebtLog, endTime=0x%4x, numDebts=%d, debtType=%d", latestEndTime, numberOfDebts, debtType);
  nodeId = emberAfCurrentCommand()->source;
  srcEndpoint = emberAfGetCommandApsFrame()->destinationEndpoint;
  dstEndpoint = emberAfGetCommandApsFrame()->sourceEndpoint;
  emberAfSetCommandEndpoints(srcEndpoint, dstEndpoint);

  emberAfPluginSendPublishDebtLog(nodeId, srcEndpoint, dstEndpoint, latestEndTime, numberOfDebts, debtType);

  return true;
}

#endif // UC_BUILD

void emberAfPluginPrepaymentPrintDebtLogIndex(uint8_t index)
{
  if ( index < DEBT_LOG_TABLE_SIZE ) {
    emberAfPrepaymentClusterPrintln("= Debt Log Entry %d:", index);
    emberAfPrepaymentClusterPrintln("  collectionTime=0x%4x", DebtLogTable[index].collectionTime);
    emberAfPrepaymentClusterPrintln("  amountCollected=%d", DebtLogTable[index].amountCollected);
    emberAfPrepaymentClusterPrintln("  outstandingDebt=%d", DebtLogTable[index].outstandingDebt);
    emberAfPrepaymentClusterPrintln("  debtType=%d", DebtLogTable[index].debtType);
  } else {
    emberAfPrepaymentClusterPrintln("ERROR: Debt Log index %d out of bounds", index);
  }
}

// When a Top Up occurs, check if a percentage of the Top Off must be applied towards debt.
// Return that amount.
uint32_t emberAfPluginPrepaymentGetDebtRecoveryTopUpPercentage(uint8_t endpoint, uint32_t topUpValue)
{
  EmberAfStatus status;
  uint32_t reduction;
  uint16_t attributeId;
  uint16_t percentage;
  uint16_t totalPercentage = 0;
  uint8_t  recoveryMethod;
  uint8_t  i;

  for ( i = 0; i < 3; i++ ) {
    attributeId = ZCL_DEBT_RECOVERY_TOP_UP_PERCENTAGE_1_ATTRIBUTE_ID + (i * DEBT_RECOVERY_GROUP_DELTA);
    status =  emberAfReadAttribute(endpoint, ZCL_PREPAYMENT_CLUSTER_ID, attributeId, CLUSTER_MASK_SERVER,
                                   (uint8_t *)&percentage, 2, NULL);

    attributeId = ZCL_DEBT_RECOVERY_METHOD_1_ATTRIBUTE_ID + (i * DEBT_RECOVERY_GROUP_DELTA);
    status |= emberAfReadAttribute(endpoint, ZCL_PREPAYMENT_CLUSTER_ID, attributeId, CLUSTER_MASK_SERVER,
                                   (uint8_t *)&recoveryMethod, 1, NULL);
    if ( (status == EMBER_ZCL_STATUS_SUCCESS) && (recoveryMethod == DEBT_RECOVERY_METHOD_PERCENT_BASED) ) {
      totalPercentage += percentage;
    }
  }
  // TOP_UP_PERCENTAGE is a u16, stored as xxx.xxx%.  Max value is 100.00%, or 10,000, or 0x2710.
  // To compute the actual top up reduction, multiply by the total percentage, then divide by 10,000.
  // Values are rounded down to the nearest integer.
  if ( totalPercentage ) {
    reduction = (topUpValue * totalPercentage) / 10000;
    emberAfPrepaymentClusterPrintln("Appying Debt Recovery to Top Up %d percent, or %d", (totalPercentage / 100), reduction);
  } else {
    emberAfPrepaymentClusterPrintln("No Top Up Debt Recovery found");
    reduction = 0;
  }
  return reduction;
}

void emberAfPluginPrepaymentPrintDebtAttributes(uint8_t endpoint, uint8_t index)
{
  uint16_t attributeId;
  EmberAfStatus status;
  uint32_t val32u;
  uint16_t val16u;
  uint8_t  val8u;
  uint8_t  valString[14];

  if ( index >= 3 ) {
    emberAfPrepaymentClusterPrintln("= ERROR: Debt Attrib Set %d out of bounds", index);
    return;
  }

  emberAfPrepaymentClusterPrintln("= Debt Attribute Set #%d:", index);

  attributeId = ZCL_DEBT_LABEL_1_ATTRIBUTE_ID + (index * DEBT_RECOVERY_GROUP_DELTA);
  status = emberAfReadAttribute(endpoint, ZCL_PREPAYMENT_CLUSTER_ID, attributeId, CLUSTER_MASK_SERVER,
                                (uint8_t *)&valString, 14, NULL);

  emberAfPrepaymentClusterPrintln("  DebtLabel status=0x%x, val=0x%x %x %x %x %x %x %x %x %x %x %x %x %x %x...", status, valString[0], valString[1],
                                  valString[2], valString[3], valString[4], valString[5], valString[6], valString[7],
                                  valString[8], valString[9], valString[10], valString[11], valString[12], valString[13]);

  attributeId = ZCL_DEBT_AMOUNT_1_ATTRIBUTE_ID + (index * DEBT_RECOVERY_GROUP_DELTA);
  status = emberAfReadAttribute(endpoint, ZCL_PREPAYMENT_CLUSTER_ID, attributeId, CLUSTER_MASK_SERVER,
                                (uint8_t *)&val32u, 4, NULL);
  emberAfPrepaymentClusterPrintln("  DebtAmount status=0x%x, val=%d", status, val32u);

  attributeId = ZCL_DEBT_RECOVERY_METHOD_1_ATTRIBUTE_ID + (index * DEBT_RECOVERY_GROUP_DELTA);
  status = emberAfReadAttribute(endpoint, ZCL_PREPAYMENT_CLUSTER_ID, attributeId, CLUSTER_MASK_SERVER,
                                (uint8_t *)&val8u, 1, NULL);
  emberAfPrepaymentClusterPrintln("  RecovMethod status=0x%x, val=%d", status, val8u);

  attributeId = ZCL_DEBT_RECOVERY_START_TIME_1_ATTRIBUTE_ID + (index * DEBT_RECOVERY_GROUP_DELTA);
  status = emberAfReadAttribute(endpoint, ZCL_PREPAYMENT_CLUSTER_ID, attributeId, CLUSTER_MASK_SERVER,
                                (uint8_t *)&val32u, 4, NULL);
  emberAfPrepaymentClusterPrintln("  RecovStartTime status=0x%x, val=%d", status, val32u);

  attributeId = ZCL_DEBT_RECOVERY_COLLECTION_TIME_1_ATTRIBUTE_ID + (index * DEBT_RECOVERY_GROUP_DELTA);
  status = emberAfReadAttribute(endpoint, ZCL_PREPAYMENT_CLUSTER_ID, attributeId, CLUSTER_MASK_SERVER,
                                (uint8_t *)&val16u, 2, NULL);
  emberAfPrepaymentClusterPrintln("  RecovCollectTime status=0x%x, val=%d", status, val16u);

  attributeId = ZCL_DEBT_RECOVERY_FREQUENCY_1_ATTRIBUTE_ID + (index * DEBT_RECOVERY_GROUP_DELTA);
  status = emberAfReadAttribute(endpoint, ZCL_PREPAYMENT_CLUSTER_ID, attributeId, CLUSTER_MASK_SERVER,
                                (uint8_t *)&val8u, 1, NULL);
  emberAfPrepaymentClusterPrintln("  RecovFreq status=0x%x, val=%d", status, val8u);

  attributeId = ZCL_DEBT_RECOVERY_AMOUNT_1_ATTRIBUTE_ID + (index * DEBT_RECOVERY_GROUP_DELTA);
  status = emberAfReadAttribute(endpoint, ZCL_PREPAYMENT_CLUSTER_ID, attributeId, CLUSTER_MASK_SERVER,
                                (uint8_t *)&val32u, 4, NULL);
  emberAfPrepaymentClusterPrintln("  RecovAmount status=0x%x, val=%d", status, val32u);

  attributeId = ZCL_DEBT_RECOVERY_TOP_UP_PERCENTAGE_1_ATTRIBUTE_ID + (index * DEBT_RECOVERY_GROUP_DELTA);
  status = emberAfReadAttribute(endpoint, ZCL_PREPAYMENT_CLUSTER_ID, attributeId, CLUSTER_MASK_SERVER,
                                (uint8_t *)&val16u, 2, NULL);
  emberAfPrepaymentClusterPrintln("  RecovPercent status=0x%x, val=%d", status, val16u);
}
